## Exercise Review

[Exercise Set](https://ds.codeup.com/python/dataframes/)

In [2]:
import pandas as pd

import numpy as np

from pydataset import data


np.random.seed(123)

students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas',
            'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

In [3]:

# randomly generate scores for each student for each subject
# note that all the values need to have the same length here
math_grades = np.random.randint(low=60, high=100, size=len(students))
english_grades = np.random.randint(low=60, high=100, size=len(students))
reading_grades = np.random.randint(low=60, high=100, size=len(students))

df = pd.DataFrame({'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades})

type(df)

pandas.core.frame.DataFrame

In [4]:
df

       name  math  english  reading
0     Sally    62       85       80
1      Jane    88       79       67
2     Suzie    94       74       95
3     Billy    98       96       88
4       Ada    77       92       98
5      John    79       76       93
6    Thomas    82       64       81
7     Marie    93       63       90
8    Albert    92       62       87
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72

### 1.  Copy the code from the lesson to create a dataframe full of student grades.

<div class="alert alert-block alert-info">

a) Create a column named `passing_english` that indicates whether each student has a passing grade in english.

In [6]:
# check if the student has a passing english grade:
# check df.english series to 70 value.  this outputs a boolean
df['english'] > 70

0      True
1      True
2      True
3      True
4      True
5      True
6     False
7     False
8     False
9      True
10     True
11    False
Name: english, dtype: bool

In [7]:
df['passing_english'] = df['english'] > 70

<div class="alert alert-block alert-info">

b) Sort the english grades by the `passing_english` column. How are duplicates handled?

In [8]:
# a: all rows remain, secondary sort appears to be by ascending index
df.sort_values('passing_english')

       name  math  english  reading  passing_english
6    Thomas    82       64       81            False
7     Marie    93       63       90            False
8    Albert    92       62       87            False
11     Alan    92       62       72            False
0     Sally    62       85       80             True
1      Jane    88       79       67             True
2     Suzie    94       74       95             True
3     Billy    98       96       88             True
4       Ada    77       92       98             True
5      John    79       76       93             True
9   Richard    69       80       94             True
10    Isaac    92       99       93             True

<div class="alert alert-block alert-info">

c) Sort the english grades first by `passing_english` and then by student name. All the students that are failing english should be first, and within the students that are failing english they should be ordered alphabetically. The same should be true for the students passing english. (Hint: you can pass a list to the `.sort_values method`)

In [9]:
df.sort_values(
    [
        'passing_english',
        'name'
    ])

       name  math  english  reading  passing_english
11     Alan    92       62       72            False
8    Albert    92       62       87            False
7     Marie    93       63       90            False
6    Thomas    82       64       81            False
4       Ada    77       92       98             True
3     Billy    98       96       88             True
10    Isaac    92       99       93             True
1      Jane    88       79       67             True
5      John    79       76       93             True
9   Richard    69       80       94             True
0     Sally    62       85       80             True
2     Suzie    94       74       95             True

<div class="alert alert-block alert-info">

d) Sort the english grades first by `passing_english`, and then by the actual english grade, similar to how we did in the last step.

In [10]:
df.sort_values(
    [
        'passing_english',
        'english'
    ]
)

       name  math  english  reading  passing_english
8    Albert    92       62       87            False
11     Alan    92       62       72            False
7     Marie    93       63       90            False
6    Thomas    82       64       81            False
2     Suzie    94       74       95             True
5      John    79       76       93             True
1      Jane    88       79       67             True
9   Richard    69       80       94             True
0     Sally    62       85       80             True
4       Ada    77       92       98             True
3     Billy    98       96       88             True
10    Isaac    92       99       93             True

<div class="alert alert-block alert-info">

e) Calculate each students overall grade and add it as a column on the dataframe. The overall grade is the average of the math, english, and reading grades.

In [14]:
# three grades divided by three, like how we would normally do
# an average, but across entire series
df = df.assign(
    overall_grade = (df.math + df.english + df.reading) / 3
)

### 2. Load the mpg dataset. Read the documentation for the dataset and use it for the following questions:

In [15]:
from pydataset import data

In [17]:
# to read the docs,
data('mpg', show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

In [18]:
mpg = data('mpg')

In [19]:
type(mpg)

pandas.core.frame.DataFrame

<div class="alert alert-block alert-success">

a) How many rows and columns are there?

In [20]:
# shape!
mpg.shape

(234, 11)

<div class="alert alert-block alert-success">

b)         What are the data types of each column?

In [21]:
mpg.dtypes

manufacturer     object
model            object
displ           float64
year              int64
cyl               int64
trans            object
drv              object
cty               int64
hwy               int64
fl               object
class            object
dtype: object

<div class="alert alert-block alert-success">

c) Summarize the dataframe with `.info` and `.describe`

In [22]:
mpg.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 234 entries, 1 to 234
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   displ         234 non-null    float64
 3   year          234 non-null    int64
 4   cyl           234 non-null    int64
 5   trans         234 non-null    object
 6   drv           234 non-null    object
 7   cty           234 non-null    int64
 8   hwy           234 non-null    int64
 9   fl            234 non-null    object
 10  class         234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 21.9+ KB

In [23]:
mpg.describe()

            displ         year         cyl         cty         hwy
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

<div class="alert alert-block alert-success">

d) Rename the `cty` column to `city`.

In [26]:
# renaming: use the rename method call!
# make sure to reassign mpg to retain these changes!
mpg = mpg.rename(columns={'cty': 'city',
                         'hwy': 'highway'})

<div class="alert alert-block alert-success">

e) Rename the `hwy` column to `highway`.

In [28]:
# see above!

<div class="alert alert-block alert-success">

f ) Do any cars have better city mileage than highway mileage?

In [31]:
mpg[['city', 'highway']]

     city  highway
1      18       29
2      21       29
3      20       31
4      21       30
5      16       26
..    ...      ...
230    19       28
231    21       29
232    16       26
233    18       26
234    17       26

[234 rows x 2 columns]

In [32]:
(mpg.city > mpg.highway).sum()

0

<div class="alert alert-block alert-success">

g)         Create a column named `mileage_difference`. This column should contain the difference between highway and city mileage for each car.

In [33]:
mpg.highway - mpg.city

1      11
2       8
3      11
4       9
5      10
       ..
230     9
231     8
232    10
233     8
234     9
Length: 234, dtype: int64

In [34]:
mpg['mileage_difference'] = \
(mpg.highway - mpg.city)

<div class="alert alert-block alert-success">

h) Which car (or cars) has the highest mileage difference?

In [37]:
mpg.sort_values('mileage_difference', ascending=False).head(2)

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,mileage_difference
107,honda,civic,1.8,2008,4,auto(l5),f,24,36,c,subcompact,12
223,volkswagen,new beetle,1.9,1999,4,auto(l4),f,29,41,d,subcompact,12

In [39]:
mpg[mpg.mileage_difference == mpg.mileage_difference.max()]

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,mileage_difference
107,honda,civic,1.8,2008,4,auto(l5),f,24,36,c,subcompact,12
223,volkswagen,new beetle,1.9,1999,4,auto(l4),f,29,41,d,subcompact,12

<div class="alert alert-block alert-success">

i) Which compact class car has the lowest highway mileage? The best?

In [41]:
mpg.sort_values('highway', ascending=False).head()

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,mileage_difference
222,volkswagen,new beetle,1.9,1999,4,manual(m5),f,35,44,d,subcompact,9
213,volkswagen,jetta,1.9,1999,4,manual(m5),f,33,44,d,compact,11
223,volkswagen,new beetle,1.9,1999,4,auto(l4),f,29,41,d,subcompact,12
197,toyota,corolla,1.8,2008,4,manual(m5),f,28,37,r,compact,9
106,honda,civic,1.8,2008,4,auto(l5),f,25,36,r,subcompact,11

In [49]:
# narrow down results to compact cars

In [53]:
mpg[mpg['class'] == 'compact'].highway.max()

44

In [54]:
mpg[mpg['class'] == 'compact'].highway.min()

23

In [55]:
max_hwy_compact = mpg[mpg['class'] == 'compact'].highway.max()
min_hwy_compact = mpg[mpg['class'] == 'compact'].highway.min()

In [45]:
# max and min
# for everything without filtering: max_hwy = mpg.highway.max()
# min_hwy = mpg.highway.min()

In [56]:
mpg[mpg['class'] == 'compact'].describe()['highway']['max']

44.0

In [59]:
compact_mask = (mpg['class'] == 'compact')

In [60]:
# mpg where the highway mileage is either the best or the worst
mpg[compact_mask][(mpg.highway == max_hwy_compact) |
   (mpg.highway == min_hwy_compact)]

/var/folders/64/db_n95vn5jbbj1ysbq4cwd_r0000gn/T/ipykernel_2853/276305587.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  mpg[compact_mask][(mpg.highway == max_hwy_compact) |

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,mileage_difference
213,volkswagen,jetta,1.9,1999,4,manual(m5),f,33,44,d,compact,11
220,volkswagen,jetta,2.8,1999,6,auto(l4),f,16,23,r,compact,7

In [61]:
mpg[(mpg['class'] == 'compact') & 
    (
        (mpg.highway == max_hwy_compact) |
       (mpg.highway == min_hwy_compact)
    )]

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,mileage_difference
213,volkswagen,jetta,1.9,1999,4,manual(m5),f,33,44,d,compact,11
220,volkswagen,jetta,2.8,1999,6,auto(l4),f,16,23,r,compact,7

<div class="alert alert-block alert-success">

j) Create a column named `average_mileage` that is the mean of the city and highway mileage.

In [64]:
mpg.assign(
    avg_mileage = (mpg.highway + mpg.city / 2)
)[['avg_mileage']].head()

   avg_mileage
1         38.0
2         39.5
3         41.0
4         40.5
5         34.0

In [66]:
# harmonic means:
mpg = mpg.assign(
    harm_avg = 2 / ((1 / mpg.highway) + (1/mpg.city)))

<div class="alert alert-block alert-success">
    
k) Which Dodge car has the best average mileage? The worst?

In [67]:
# filter #1: dodge cars specifically
# filter #2: the best average mileage

In [70]:
mpg.manufacturer.value_counts()

dodge         37
toyota        34
volkswagen    27
ford          25
chevrolet     19
audi          18
hyundai       14
subaru        14
nissan        13
honda          9
jeep           8
pontiac        5
land rover     4
mercury        4
lincoln        3
Name: manufacturer, dtype: int64

In [75]:
# filter 1:
manufacturer_mask = (mpg.manufacturer == 'dodge')

In [78]:
# filter 2:
# best average mileage, but not overall, just the condition
# that it has the best avg mileage for dodge specifically
max_mpg_dodge = mpg[manufacturer_mask]['harm_avg'].max()

In [73]:
mpg[mpg.manufacturer == 'dodge']['harm_avg'].max()

20.571428571428573

In [77]:
mpg[manufacturer_mask]['harm_avg'].max()

20.571428571428573

In [84]:
max_mask = mpg.harm_avg == max_mpg_dodge

In [82]:
manufacturer_mask

1      False
2      False
3      False
4      False
5      False
       ...
230    False
231    False
232    False
233    False
234    False
Name: manufacturer, Length: 234, dtype: bool

In [85]:
max_mask

1      False
2      False
3      False
4      False
5      False
       ...
230    False
231    False
232    False
233    False
234    False
Name: harm_avg, Length: 234, dtype: bool

In [86]:
mpg[manufacturer_mask & max_mask]

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,mileage_difference,harm_avg
38,dodge,caravan 2wd,2.4,1999,4,auto(l3),f,18,24,r,minivan,6,20.571429

###   3  Load the `Mammals` dataset. Read the documentation for it, and use the data to answer these questions:

<div class="alert alert-block alert-info">

a) How many rows and columns are there?

<div class="alert alert-block alert-info">

b) Summarize the dataframe with `.info` and `.describe`

<div class="alert alert-block alert-info">


c) What is the the weight of the fastest animal?

<div class="alert alert-block alert-info">

d) What is the overall percentage of specials?

<div class="alert alert-block alert-info">

e) How many animals are hoppers that are above the median speed? What percentage is this?